// конфиг профиля

export const profile = {
  avatar: '',    // фотка, адресс на изображение. Пусто значит будет первая буква name

  name:   'mirarz',
  handle: 'caputmanus',
  bio:    'frontend/fullstack • энтузиаст по ОСам • архивист SCP • типолог\nbuilding things from the void ✦',
}

//  ссылка
//  color: pink, cyan, purple, yellow
//  icon:  можно вставить SVG как строку или эмодзи

//  ссылки можно добавлять в массив произвольно и удалять тоже

export const links = [
  {
    id:    'github',
    label: 'GitHub',
    url:   'https://github.com/',
    icon:  `<svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">
              <path d="M12 0C5.37 0 0 5.37 0 12c0 5.3 3.44 9.8 8.2 11.4.6.1.82-.26.82-.58
                       0-.28-.01-1.03-.02-2.03-3.34.72-4.04-1.61-4.04-1.61-.55-1.39-1.34-1.76-1.34-1.76
                       -1.09-.74.08-.73.08-.73 1.2.09 1.84 1.24 1.84 1.24 1.07 1.83 2.8 1.3 3.49 1
                       .11-.78.42-1.3.76-1.6-2.67-.3-5.47-1.33-5.47-5.93
                       0-1.31.47-2.38 1.24-3.22-.13-.3-.54-1.52.12-3.18
                       0 0 1.01-.32 3.3 1.23a11.5 11.5 0 0 1 3-.4c1.02.01 2.04.14 3 .4
                       2.28-1.55 3.29-1.23 3.29-1.23.66 1.66.25 2.88.12 3.18
                       .77.84 1.24 1.91 1.24 3.22 0 4.61-2.81 5.63-5.48 5.92
                       .43.37.81 1.1.81 2.22 0 1.6-.01 2.9-.01 3.29
                       0 .32.22.69.83.57A12.01 12.01 0 0 0 24 12C24 5.37 18.63 0 12 0z"/>
            </svg>`,
    color: 'purple',
  },
  {
    id:    'telegram',
    label: 'Telegram',
    url:   'https://t.me/',
    icon:  `<svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">
              <path d="M12 0C5.37 0 0 5.37 0 12s5.37 12 12 12 12-5.37 12-12S18.63 0 12 0zm5.9 8.1
                       -2.05 9.65c-.15.67-.55.83-1.11.52l-3.07-2.26-1.48 1.42c-.16.16-.3.3-.62.3
                       l.22-3.1 5.63-5.08c.24-.22-.05-.34-.38-.12L6.38 14.32l-3-0.94
                       c-.65-.2-.66-.65.14-.96l11.6-4.47c.54-.2 1.01.13.78.15z"/>
            </svg>`,
    color: 'cyan',
  },
  {
    id:    'youtube',
    label: 'YouTube',
    url:   'https://youtube.com/',
    icon:  `<svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">
              <path d="M23.5 6.2a3.01 3.01 0 0 0-2.12-2.13C19.54 3.6 12 3.6 12 3.6
                       s-7.54 0-9.38.47A3.01 3.01 0 0 0 .5 6.2 31.5 31.5 0 0 0 0 12a31.5 31.5 0 0 0 .5 5.8
                       A3.01 3.01 0 0 0 2.62 19.93C4.46 20.4 12 20.4 12 20.4s7.54 0 9.38-.47
                       a3.01 3.01 0 0 0 2.12-2.13c.32-1.87.5-3.83.5-5.8
                       0-1.97-.18-3.93-.5-5.8zM9.75 15.52V8.48L15.5 12l-5.75 3.52z"/>
            </svg>`,
    color: 'pink',
  },
]
